---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCFile..::..Read Method
IFCFile Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Read(IFCFileReadOptions) | Reads content from a file of IFC format. |
|  | Read(IFCFileReadOptions, Int32%, Int32%) | Reads content from a file of IFC format. |

# See Also

IFCFile Class

IFCFile Members

Autodesk.Revit.DB.IFC Namespace